[{"title": "Space History Is Made in This NASA Robot Factory", "preview": "From rockets to rovers, JPL's Spacecraft Assembly Facility has been at the center of robotic spaceflight. Here's a closer look at what makes it so special."}, {"title": "NASA's Mars Reconnaissance Orbiter Undergoes Memory Update", "preview": "Other orbiters will continue relaying data from Mars surface missions for a two-week period."}, {"title": "NASA's MAVEN Maps Winds in the Martian Upper Atmosphere that Mirror the Terrain Below and Gives Clues to Martian Climate", "preview": "Researchers have created the first map of wind circulation in the upper atmosphere of a planet besides Earth, using data from NASA’s MAVEN spacecraft that were collected during the last two years."}, {"title": "NASA's MAVEN Explores Mars to Understand Radio Interference at Earth", "preview": "NASA’s MAVEN spacecraft has discovered “layers” and “rifts” in the electrically charged part of the upper atmosphere of Mars."}, {"title": "Heat and Dust Help Launch Martian Water Into Space, Scientists Find", "preview": "Scientists using an instrument aboard NASA’s Mars Atmosphere and Volatile EvolutioN, or MAVEN, spacecraft have discovered that water vapor near the surface of the Red Planet is lofted higher into the atmosphere than anyone expected was possible. "}, {"title": "NASA's Perseverance Rover Is Midway to Mars ", "preview": "Sometimes half measures can be a good thing – especially on a journey this long. The agency's latest rover only has about 146 million miles left to reach its destination."}, {"title": "The MarCO Mission Comes to an End", "preview": "The pair of briefcase-sized satellites made history when they sailed past Mars in 2019."}, {"title": "NASA's Mars 2020 Rover Completes Its First Drive", "preview": "In a 10-plus-hour marathon, the rover steered, turned and drove in 3-foot (1-meter) increments over small ramps."}, {"title": "NASA Establishes Board to Initially Review Mars Sample Return Plans", "preview": "The board will assist with analysis of current plans and goals for one of the most difficult missions humanity has ever undertaken."}, {"title": "Nine Finalists Chosen in NASA's Mars 2020 Rover Naming Contest", "preview": "Nine finalists have been chosen in the essay contest for K-12 students across U.S. to name NASA's next Mars rover. Now you can help by voting for your favorite. "}, {"title": "NASA's Perseverance Rover 100 Days Out", "preview": "Mark your calendars: The agency's latest rover has only about 8,640,000 seconds to go before it touches down on the Red Planet, becoming history's next Mars car."}, {"title": "With Mars Methane Mystery Unsolved, Curiosity Serves Scientists a New One: Oxygen", "preview": "For the first time in the history of space exploration, scientists have measured the seasonal changes in the gases that fill the air directly above the surface of Gale Crater on Mars. "}, {"title": "NASA Invites Students to Name Mars 2020 Rover", "preview": "Through Nov. 1, K-12 students in the U.S. are encouraged to enter an essay contest to name NASA's next Mars rover."}, {"title": "NASA's Ingenuity Mars Helicopter Recharges Its Batteries in Flight", "preview": "Headed to the Red Planet with the Perseverance rover, the pioneering helicopter is powered up for the first time in interplanetary space as part of a systems check."}, {"title": "NASA's Mars Perseverance Rover Gets Its Sample Handling System", "preview": "The system will be collecting and storing Martian rock and soil. Its installation marks another milestone in the march toward the July launch period."}]